---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRightRunBoundary2d
source: html/f98ccaf2-715c-06cd-2105-84a7fd8dc572.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRightRunBoundary2d Property

"Show Run's Right Boundary 2D"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRightRunBoundary2d { get; }
```